// Группы объектов
// var groups = [
//         {
//             name: "Известные памятники",
//             style: "islands#redIcon",
//             items: [
//                 {
//                     center: [50.426472, 30.563022],
//                     name: "Монумент &quot;Родина-Мать&quot;"
//                 },
//                 {
//                     center: [50.45351, 30.516489],
//                     name: "Памятник &quot;Богдану Хмельницкому&quot;"
//                 },
//                 {
//                     center: [50.454433, 30.529874],
//                     name: "Арка Дружбы народов"
//                 }
//             ]},
//         {
//             name: "Покушайки",
//             style: "islands#greenIcon",
//             items: [
//                 {
//                     center: [50.50955, 30.60791],
//                     name: "Ресторан &quot;Калинка-Малинка&quot;"
//                 },
//                 {
//                     center: [50.429083, 30.521708],
//                     name: "Бар &quot;Сало-бар&quot;"
//                 },
//                 {
//                     center: [50.450843, 30.498271],
//                     name: "Абсент-бар &quot;Палата №6&quot;"
//                 },
//                 {
//                     center: [50.454834, 30.516498],
//                     name: "Ресторан &quot;Спотыкач&quot;"
//                 }
//             ]},
//         {
//             name: "Оригинальные музейчики",
//             style: "islands#orangeIcon",
//             items: [
//                 {
//                     center: [50.443334, 30.520163],
//                     name: "Музей грамзаписи и старинных музыкальных инструментов"
//                 },
//                 {
//                     center: [50.446977, 30.505269],
//                     name: "Музей истории медицины или Анатомический театр"
//                 },
//                 {
//                     center: [50.452512, 30.530889],
//                     name: "Музей воды. Водно-информационный центр"
//                 }
//             ]},
//         {
//             name: "Красивости",
//             style: "islands#blueIcon",
//             items: [
//                 {
//                     center: [50.45987, 30.516174],
//                     name: "Замок Ричарда-Львиное сердце"
//                 },
//                 {
//                     center: [50.445049, 30.528598],
//                     name: "&quot;Дом с химерами&quot;"
//                 },
//                 {
//                     center: [50.449156, 30.511809],
//                     name: "Дом Рыцаря"
//                 }
//             ]}
//     ];
var groups = [
    {
        name: "Ресурс1",
        style: "islands#redIcon",
        items: [
            {
                center: [50.426472, 30.563022],
                name: "&quot;Вагон1.1&quot; &#9745;"
            },
            {
                center: [50.45351, 30.516489],
                name: "&quot;Вагон1.2&quot; &#9746"
            },
            {
                center: [50.454433, 30.529874],
                name: "&quot;Вагон1.3&quot; &#9745;"
            }
        ]},
    {
        name: "Ресурс2",
        style: "islands#greenIcon",
        items: [
            {
                center: [50.50955, 30.60791],
                name: "&quot;Вагон2.1&quot; &#9745;"
            },
            {
                center: [50.429083, 30.521708],
                name: "&quot;Вагон2.2&quot; &#9746;"
            },
            {
                center: [50.450843, 30.498271],
                name: "&quot;Вагон2.3&quot; &#9746;"
            },
            {
                center: [50.454834, 30.516498],
                name: "&quot;Вагон2.4&quot; &#9745;"
            }
        ]},
    {
        name: "Ресурс3",
        style: "islands#orangeIcon",
        items: [
            {
                center: [50.443334, 30.520163],
                name: "&quot;Вагон3.1&quot; &#9745;"
            },
            {
                center: [50.446977, 30.505269],
                name: "&quot;Вагон3.2&quot; &#9745;"
            },
            {
                center: [50.452512, 30.530889],
                name: "&quot;Вагон3.3&quot; &#9746;"
            }
        ]},
    {
        name: "Ресурс4",
        style: "islands#blueIcon",
        items: [
            {
                center: [50.45987, 30.516174],
                name: "&quot;Вагон4.1&quot; &#9745;"
            },
            {
                center: [50.445049, 30.528598],
                name: "&quot;Вагон4.2&quot; &#9746;"
            },
            {
                center: [50.449156, 30.511809],
                name: "&quot;Вагон4.3&quot; &#9745;"
            }
        ]}
];